Revit 2027 API
KeyBasedTreeEntryError Methods
The KeyBasedTreeEntryError type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEntry |  Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace